{"meta":{"title":"忽如远行客","subtitle":"人生天地间，忽如远行客","description":null,"author":"二次元阿宅","url":"http://yoursite.com","root":"/"},"pages":[{"title":"","date":"2019-03-06T01:14:31.000Z","updated":"2019-03-06T01:15:17.325Z","comments":false,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""},{"title":"","date":"2019-03-06T01:10:02.000Z","updated":"2019-03-06T01:15:40.558Z","comments":false,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"基于遗传算法的无限传感器网络的优化","slug":"基于遗传算法的无限传感器网络的优化","date":"2019-03-31T14:36:18.000Z","updated":"2019-04-01T09:09:45.074Z","comments":true,"path":"2019/03/31/基于遗传算法的无限传感器网络的优化/","link":"","permalink":"http://yoursite.com/2019/03/31/基于遗传算法的无限传感器网络的优化/","excerpt":"","text":"一、摘要 无线传感器网络=若干个传感器节点（低成本、低功耗、多功能） 有线网络布网费用高，维护繁琐 无线传感器网络的最大问题：无线床啊其节点的能量消耗极大，限制了网络的工作寿命 二、绪论 2.1 课题的研究背景以及研究的意义 无线传感器网络的研究起源于…… 无线传感器网络=无线通信技术+大量的传感器节点+自组织方式 大面积环境的数据+不适宜部署有线网络的领域 无线传感器网络具有成本低、鲁棒性高、功耗小、灵活性高、布网简单、智能化强、维护便捷 2.2 遗传算法的发展 遗传算法 高度并行 随机 自适应 基本理念来源于达尔文的遗传学说 GA在理论上具有解决任何寻优问题的能力，具有极其广泛的应用价值。 Holland教授 模式定理：优良个体的样本数目将以指数规律增长，从而确保了遗传算法是 一个能够用来搜寻最优可行解的过程。 2.3无线传感器网络研究的发展状况 2003年，美国《技术评论》杂志评出了对人类未来生活产生重大影响的新兴科技，被列为第一位的就是无线传感网络技术。 无线传感器网络最开始被用在军事的监视系统中 无线传感网络是集通信技术、传感器技术和计算技术于一身的产物 2.4 本文的应用背景 无线传感器在露天矿场的边坡检测的例子 2.5本文研究目的和主要任务 无线传感器网络最难解决的缺点是：和有线网络相比，无线传感器网络的工作周期极大的受到能源的限制。充电或者更换电池会限制网络中的节点的通信和数据的处理，但是个别节点失灵不会影响整体的工作。 优化无线传感器网络的关键是延长整个网络的工作寿命。 2.6 本文的创新点 三、无线传感网络 无线传感网络是…… 无线传感网络可以分为动态网络和静态网络两种。 3.1无线传感网络结构 无线传感网路主要由传感器节点、任务管理节点、汇聚节点组成。 传感器节点采集到的数据通过多跳网络或者单跳网络传输到簇头，再到汇聚节点，最终通过卫星或者互联网传输到管理节点。 传感器节点一般是微型的嵌入式系统，能力较弱，通过携带电池通电。无线传感器网络中汇聚节点的能力比较强，传感器网络和外部网络就是通过汇聚节点相连接的。 对于多跳网络来说，每个传感器节点必须兼顾终端和路由器的功能，主要功能：信息采集、数据存储和再次的转发。 对于单跳的网络来说，簇头节点就是路由器和终端。 3.2无线传感网络的特点 无线传感器网络相对于其他传统网络的特点： 组网的规模够大，可以进行动态组网或者静态组网，而且容错性加强 单跳、多跳、自组织：传感器的通信距离是有限的，当超过一定的距离的时候，自动组成簇，通过多跳的方式从簇头传递到汇聚节点。 低功耗：环境恶劣，更换电池不容易，所以传感器节点必须是低功耗的。 数据作为中心：传统网络中，每一个工作节点必须在全网中有唯一的一个编号作为其通信地址；但是在无线传感器网路中，获得所需要的数据是第一要务，数据是从哪里来的是不重要的。 通信的覆盖范围较小。 数据处理：传统网络的主要职责是数据传输，自终端上处理数据，中间的节点仅仅负责传输数据；但是对于无线传感网络来说，中间节点同时具备数据传输和数据处理的功能。 低成本：每个传感器节点都应该低成本，低价格。 3.3无线传感网络节点结构 传感网络节点的组成通常是由四部分组成的：处理器模块、传感器模块、能量供应模块、无线通信模块 数据采集、数据传递、数据处理和能量供应 3.4传感器节点的限制因素 电源能量有限：处理器和传感器浪费的能量少，主要消耗在无线通信模块。（此处可以配图说明） 通信能力有限：E=kd^n。其中参数n的取值在2到4之间，干扰越大n的取值也越大，n的取值通常设置为3，随着距离的增加，能量的损耗也会增加，所以传感器之间的距离应该在100米以内。 四、遗传算法概述 遗传算法受到了生物进化理论的启发，GA以自然界中的优胜劣汰和生物遗传机制作为理论的基础。 简单阐述遗传算法的概念。 4.1基本遗传算法 Goldberg研究出的传统的GA，只使用选择算子、交叉算子和变异算子，是GA的雏形。 编码方式： 二进制编码、浮点数编码","categories":[{"name":"学士论文相关","slug":"学士论文相关","permalink":"http://yoursite.com/categories/学士论文相关/"}],"tags":[{"name":"遗传算法 无线传感器网络优化","slug":"遗传算法-无线传感器网络优化","permalink":"http://yoursite.com/tags/遗传算法-无线传感器网络优化/"}]},{"title":"123","slug":"123","date":"2019-03-07T10:38:30.000Z","updated":"2019-03-07T10:38:30.192Z","comments":true,"path":"2019/03/07/123/","link":"","permalink":"http://yoursite.com/2019/03/07/123/","excerpt":"","text":"","categories":[],"tags":[]}]}